/////////////////////////////////////////////////////////////////////
// Problem 1
//
// 10未満の自然数のうち、3 もしくは 5 の倍数になっているものは
// 3, 5, 6, 9 の4つがあり、これらの合計は 23 になる。同じようにして、
// 1,000 未満の 3 か 5 の倍数になっている数字の合計を求めよ。
//////////////////////////////////////////////////////////////////////
#include <iostream>
#include <assert.h>

int problem1(const int n)
{
	int sum = 0;
	for (int i = 1; i < n; ++i) {
		if (i % 3 == 0 || i % 5 == 0)
			sum += i;
	}
	return sum;
}

int main(void)
{
	// test
	assert(problem1(10) == 23);

	std::cout << problem1(1000) << std::endl;
}
