//////////////////////////////////////////////////////////////////////
// Problem 2
//
// フィボナッチ数列の項は前の2つの項の和である。
// 最初の2項を 1, 2 とすれば、最初の10項は以下の通りである。
//   1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
// 数列の項の値が400万を超えない範囲で、偶数値の項の総和を求めよ。
//////////////////////////////////////////////////////////////////////
#include <iostream>
#include <assert.h>

int problem2(const int n)
{
	int sum = 2;
	int n1 = 1, n2 = 2, n3;

	do {
		n3 = n1 + n2;
		n1 = n2;
		n2 = n3;
		if (n3 % 2 == 0)
			sum += n3;
	} while (n3 < n);

	return sum;
}

int main(void)
{
	// test
	assert(problem2(89) == 2+8+34);

	std::cout << problem2(4000000) << std::endl;
}
